ycsb_run_t100_r70_u20_i10.log
mongo client connection created with mongodb://ycsb:ycsb@127.0.0.1:27017/ycsb?w=0
[OVERALL], RunTime(ms), 1194793.0
[OVERALL], Throughput(ops/sec), 41848.25321206268
[TOTAL_GCS_PS_Scavenge], Count, 766.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 5486.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4591590342427516
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 766.0
[TOTAL_GC_TIME], Time(ms), 5486.0
[TOTAL_GC_TIME_%], Time(%), 0.4591590342427516
[READ-FAILED], Operations, 2.0
[READ-FAILED], AverageLatency(us), 912.0
[READ-FAILED], MinLatency(us), 474.0
[READ-FAILED], MaxLatency(us), 1350.0
[READ-FAILED], 95thPercentileLatency(us), 1350.0
[READ-FAILED], 99thPercentileLatency(us), 1350.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 149.07
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 14719.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 16.0
[INSERT], Operations, 4995661.0
[INSERT], AverageLatency(us), 128.0571005518589
[INSERT], MinLatency(us), 19.0
[INSERT], MaxLatency(us), 1.9611647E7
[INSERT], 95thPercentileLatency(us), 145.0
[INSERT], 99thPercentileLatency(us), 807.0
[INSERT], Return=OK, 4995661
[READ], Operations, 3.5000144E7
[READ], AverageLatency(us), 3336.0277518858206
[READ], MinLatency(us), 52.0
[READ], MaxLatency(us), 1.9595263E7
[READ], 95thPercentileLatency(us), 13015.0
[READ], 99thPercentileLatency(us), 25487.0
[READ], Return=OK, 35000144
[READ], Return=NOT_FOUND, 2
[UPDATE], Operations, 1.0004193E7
[UPDATE], AverageLatency(us), 117.50030112373882
[UPDATE], MinLatency(us), 10.0
[UPDATE], MaxLatency(us), 1.9578879E7
[UPDATE], 95thPercentileLatency(us), 67.0
[UPDATE], 99thPercentileLatency(us), 347.0
[UPDATE], Return=OK, 10004193