ycsb_run_t100_r95_i5.log
mongo client connection created with mongodb://ycsb:ycsb@127.0.0.1:27017/ycsb?w=0
[OVERALL], RunTime(ms), 643134.0
[OVERALL], Throughput(ops/sec), 77744.29590100974
[TOTAL_GCS_PS_Scavenge], Count, 769.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2827.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4395662490243091
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 769.0
[TOTAL_GC_TIME], Time(ms), 2827.0
[TOTAL_GC_TIME_%], Time(%), 0.4395662490243091
[READ-FAILED], Operations, 1.0
[READ-FAILED], AverageLatency(us), 4306.0
[READ-FAILED], MinLatency(us), 4304.0
[READ-FAILED], MaxLatency(us), 4307.0
[READ-FAILED], 95thPercentileLatency(us), 4307.0
[READ-FAILED], 99thPercentileLatency(us), 4307.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 90.05
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 8751.0
[CLEANUP], 95thPercentileLatency(us), 4.0
[CLEANUP], 99thPercentileLatency(us), 14.0
[INSERT], Operations, 2500703.0
[INSERT], AverageLatency(us), 105.3323497432522
[INSERT], MinLatency(us), 22.0
[INSERT], MaxLatency(us), 1.7825791E7
[INSERT], 95thPercentileLatency(us), 104.0
[INSERT], 99thPercentileLatency(us), 664.0
[INSERT], Return=OK, 2500703
[READ], Operations, 4.7499296E7
[READ], AverageLatency(us), 1338.8095364613405
[READ], MinLatency(us), 53.0
[READ], MaxLatency(us), 1.7874943E7
[READ], 95thPercentileLatency(us), 4751.0
[READ], 99thPercentileLatency(us), 10335.0
[READ], Return=OK, 47499296
[READ], Return=NOT_FOUND, 1